app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 1) LIMIT 1
---
  def show
      @playlists = Playlist.all
      @playlist  = Playlist.find(params[:id])

INSERT INTO "playlists" ("created_at", "creator", "day", "description", "mood", "updated_at") VALUES ('2010-10-22 14:52:40.712884', 'Ja', 16, 'Playlista nr. 1', 'Happy', '2010-10-22 14:52:40.712884')
---
  def create
      @playlist = Playlist.create(params[:playlist])

SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 1) LIMIT 1
---
  def edit
      @playlist = Playlist.find(params[:id])

SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 1) LIMIT 1
UPDATE "playlists" SET "day" = 1, "description" = 'Playlista nr. ', "updated_at" = '2010-10-22 15:01:34.493289' WHERE ("playlists"."id" = 1)
---
  def update
      @playlist = Playlist.find(params[:id])
      if @playlist.update_attributes(params[:playlist])

SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 1) LIMIT 1
DELETE FROM "playlists" WHERE ("playlists"."id" = 1)
---
  def destroy
      @playlist = Playlist.find(params[:id])
      @playlist.destroy