app/controllers/songs_controller.rb

  def new
    @song = Playlist.find(params[:playlist_id]).songs.new
---
SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 2) LIMIT 1

  def create
    playlist = Playlist.find(params[:playlist_id])
    playlist.songs.create(params[:song])
---
SELECT "playlists".* FROM "playlists" WHERE ("playlists"."id" = 2) LIMIT 1
INSERT INTO "songs" ("artist", "created_at", "playlist_id", "title", "updated_at") VALUES ('Ja', '2010-10-22 15:38:25.611508', 2, 'On', '2010-10-22 15:38:25.611508')