app/views/playlists/index.html.haml

SELECT "songs".* FROM "songs" WHERE ("songs".playlist_id = 1)
---
    =playlist.mood
  =select_tag(:song_id, options_for_select( playlist.songs.map {|song| [song.artist + ' - ' + song.title, song.id]} ))